app/controllers/application_controller.rb

SELECT  `shortenurls`.* FROM `shortenurls` WHERE `shortenurls`.`key` = 'klbkjzn' LIMIT 1
---
  def goToOuterUrl
  	outerUrl = Shortenurl.find_by(key: params[:key]).originalUrl