app/controllers/shortenurls_controller.rb

	def show
		user = User.find_by(slug: params[:slug])
---
SELECT  `users`.* FROM `users` WHERE `users`.`slug` = '8z9a16tti9iat5b2dt7getkay8732h0w&1' LIMIT 1

	def create
		user = User.find_by(slug: params[:slug])
    	if user.present?
    		uu = user.shortenurls.select{|v| v.originalUrl == params[:originalUrl]}
    		if uu.any? && params[:originalUrl] != ""
   				render :json => { success: 0, error: 1, errors: ["You already created a shortener of this URL."]}
   				return;
    		end

    		@shortenurl = Shortenurl.new(name: params[:name], originalUrl: params[:originalUrl], user_id: user.id)

    		if @shortenurl.save
    			key = Array.new(7){rand(36).to_s(36)}.join
    			obj = Shortenurl.find_by(key: key)
---
SELECT  `users`.* FROM `users` WHERE `users`.`slug` = '8z9a16tti9iat5b2dt7getkay8732h0w&1' LIMIT 1
SELECT `shortenurls`.* FROM `shortenurls` WHERE `shortenurls`.`user_id` = 1
INSERT INTO `shortenurls` (`originalUrl`, `created_at`, `updated_at`, `name`, `user_id`) VALUES ('http://conversionincrease.herokuapp.com', '2018-03-12 09:38:54', '2018-03-12 09:38:54', 'first url', 1)
SELECT  `shortenurls`.* FROM `shortenurls` WHERE `shortenurls`.`key` = 'klbkjzn' LIMIT 1