app/controllers/users_controller.rb

INSERT INTO `users` (`firstName`, `lastName`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('Anatoly', 'Halfin', 'anatoly_halfin@outlook.com', '2018-03-12 08:36:18', '2018-03-12 08:36:18', '$2a$10$sMMTxDVLH749kMynWSlSYeqH6deit3qZlClqAhSagaqMatwd9laf.')
---
	def create
		@user = User.new(firstName: params[:firstName], lastName: params[:lastName], email: params[:email],
						password: params[:password], password_confirmation: params[:password_confirmation])

		if @user.save